[
  {
    "name": "Band Wars",
    "date": "2 Mar 2024",
    "time": "5:30 PM - 7:30 PM",
    "venue": "Admission Room, M George Block",
    "reg": ["general: 500₹"],
    "cardImg": "https://i.imgur.com/c8tS50n.png",
    "cord": [
      "Abhimanyu (S8 CSE AI) 9778377240",
      "Alias (S8 CSE AI) 9037563633"
    ],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSdujlH_pWgcrxRc6tDMyDi0-sLKMHjjhZ23z82iOJExwquYQg/viewform?usp=sf_link",
    "prize": ["80,000₹"],
    "desc": "\"Music gives a soul to the universe, wings to the mind, flight to the imagination, and life to everything.\" - Plato Music is not just heard; it is felt.Witness fierce competition as bands battle it out for supremacy on stage. The atmosphere will be electric, the tunes intense, and the energy unmatched. Join us for an epic clash of rhythms and melodies that will leave you on the edge of your seat. Bring your A-game, cheer for your favorite band, and let the battle of the beats begin! 🎶",
    "rules": [
      "Rule 1: Teams must consist of 6 to 10 members",
      "Rule 2: A college can have only one team under this category",
      "Rule 3: The maximum number of teams allowed for the event is 8",
      "Rule 4: Cross-college teams are not permitted",
      "Rule 5: A minimum of one vocalist should be there from the team",
      "Rule 6: The time limit for the performance is 15 minutes with an extra 10 minutes for setup (the maximum empty-to-empty time frame allowed is 30 minutes)",
      "Rule 7: No restrictions on the language or genre of music",
      "Rule 8: Only a drum kit will be provided by the college",
      "Rule 9: Use of samples or pre-recorded sound on stage is not permitted; all music should be performed live on stage",
      "Rule 10: Judgement will be based on originality, creativity, overall tone, musicianship, professionalism and interaction",
      "Rule 11: The decisions of the judges will be final and binding",
      "Rule 12: Participants must register via the website on or before 27th February. Only one person per team needs to register"
    ]
  },
  {
    "name": "Theme Show",
    "date": "2 Mar 2024",
    "time": "4:00 PM - 5:30 PM",
    "venue": "Vikram Sarabhai Auditorium",
    "reg": ["general: 500₹"],
    "cardImg": "https://i.imgur.com/rBJ4htE.jpeg",
    "cord": ["Abhijith (S6 CSE AI DS 9746634054"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSe0Ot8uzDS_yHLQSaRbHsJmRPAUD_X4bOtv7Ryo1BYzhsPx7g/viewform?usp=sf_link",
    "prize": ["50,000₹"],
    "desc": "A theme show is a type of presentation or exhibition of a specific theme or topic serving as the central focus,it can encompass various forms of visual art,music,dance or theatre, exploring a particular idea, concept or narrative. A team can have minimum of 8 and maximum of 10 participants.Background score should be prepared prior and be handed over to the coordinator.Total duration of 10 minutes.",
    "rules": [
      "Rule 1: Teams must consist of 8 to 10 models.",
      "Rule 2: Maximum number of teams permitted for the event is 10.",
      "Rule 3: Cross-college teams are not permitted.",
      "Rule 4: A college can have only one team under this category.",
      "Rule 5: Each performance is allotted a time limit of 10 minutes, empty to empty stage.",
      "Rule 6: Exceeding this time limit may result in disqualification. Presenting banners, posters, or other materials directly displaying the theme is prohibited.",
      "Rule 7: Background music should be cross-checked with the event coordinator one day before the event.",
      "Rule 8: Teams will be judged based on costumes, theme, walking stance and attitude.",
      "Rule 9: The decisions of the judges will be final and binding.",
      "Rule 10: Participants must register via the website on or before 27th February. Only one person per team needs to register."
    ]
  },
  {
    "name": "Eneryia - Hackathon",
    "date": "1 Mar 2024",
    "time": "12 PM - 2 PM",
    "venue": "Steve Jobs Hall, Ramanujan Block",
    "reg": ["mitsian: 150₹", "non-mitsian: 250₹"],
    "cardImg": "https://i.imgur.com/mwkVJdQ.png",
    "cord": ["Sebin Kuriakose (S8 CSE A) 9847824162"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSe5KHmLOog2MliOYGDerX9cQQ8XRCXRiloOFfzUaqblA6L5OA/viewform?usp=sf_link",
    "prize": ["75,000₹"],
    "desc": "Eneryia 2.0: Fueling Innovation in 24 Hours! Join us for an exhilarating hackathon hosted by the Computer Science Department in collaboration with ACM. Dive into a day-long coding marathon where participants will unleash their creativity, collaborate with peers, and tackle real-world challenges in the realm of technology. From groundbreaking software solutions to innovative hardware hacks, Eneryia 2.0 is the ultimate platform to push boundaries, showcase skills, and forge lasting connections in the tech community. Are you ready to power up your ideas and make a difference? Join us for Eneryia 2.0 and let's code the future together!",
    "rules": [
      "Rule 1: The hackathon is a team event with maximum 4 people in a team.",
      "Rule 2: A participant is only allowed to be part of only a single team.",
      "Rule 3: The event is open to all students currently enrolled in any Undergraduate course.",
      "Rule 4: 10 teams will be shortlisted for the main event.",
      "Rule 5: Each team while registering for the event must submit their GitHub profiles and LinkedIn profiles along with an abstract they prepared on any of the problem statements listed below. The shortlisting will be on the basis of these submitted documents and profiles.",
      "Rule 6: The final problem statements for the event shall be revealed 3 hours prior to the commencement of the event. ",
      "Rule 7: An internal round of evaluation prior to the final evaluation shall be conducted after 6 hours after the commencement of the event.",
      "Rule 8: The final evaluation shall be done by expertised judges after the 24 hour time frame. ",
      "Rule 9: Registration fee for the event shall be Rs 250 for a Non - Mitsian and Rs 150 for a Mitsian.",
      "Rule 10: The fee should only be paid if shortlisted for the hackathon."
    ]
  },
  {
    "name": "BridgeX 2.0",
    "date": "1 Mar 2024",
    "time": "10:00 AM - 5:00 PM",
    "venue": "CAD Drawing Lab, Dept. of Mechanical Engineering, M George Block",
    "reg": ["general: 150₹"],
    "cardImg": "https://i.imgur.com/37J1uzK.png",
    "cord": ["Aditya S(S6 ME) 9400238120"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSch7ep44jh6CXUSLDYeHtKepU-rANIYRMKt2mCEYBoXPW3VVA/viewform?usp=sf_link",
    "prize": ["15,000₹"],
    "desc": "BridgeX 2.0 will test the particpants to use computer-aided design (CAD) software or a 3D modeling tool to create a detailed virtual representation of the bridge. Include all relevant structural and design elements, such as supports, beams, and decking. Once the virtual bridge design is finalized, we select appropriate materials for the physical model. And test the model on factors like strength, flexibility, and weight.",
    "rules": [
      "Rule 1: No cheating",
      "Rule 2: Bring Notebook and Pen",
      "Rule 3: Maintain discipline"
    ]
  },
  {
    "name": "BlindScript Coding Competition",
    "date": "1 Mar 2024",
    "time": "10:00 AM - 2:00 PM",
    "venue": "Codd Base Lab, Ramanujan Block",
    "reg": ["general: free"],
    "cardImg": "https://i.imgur.com/m4I1RC2.png",
    "cord": ["Rohit George (S6 CSE B) 7247478565"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSd9mCnmqJqMI17sViF9UTQ1h-pG6w7z2CpwmJ6QicF1hEtqbg/viewform?usp=sf_link",
    "prize": ["20,000₹"],
    "desc": "BLIND SCRIPT Coding Challenge is a pioneering competition where participants code without visual aid, relying solely on memory and intuition. This event challenges coding enthusiasts to showcase their mental agility and adaptability by solving coding problems without screens. With a limited participant capacity, the event promises an exhilarating experience where coding meets the ultimate test of ingenuity. Registration is free, and participants have the chance to win cash rewards and recognition.",
    "rules": [
      "Rule 1: No cheating",
      "Rule 2: Bring Notebook and Pen",
      "Rule 3: Maintain discipline"
    ]
  },
  {
    "name": "Freshman Firewall(CTF)",
    "date": "1 Mar 2024",
    "time": "10:00 AM - 2:00 PM",
    "venue": "FOSS Lab, Ramanujan Block",
    "reg": ["mitsian: 50₹", "non-mitsian: 100₹"],
    "cardImg": "https://i.imgur.com/gUZJHXi.jpeg",
    "cord": ["Ragesh (MTech) 9497276184", "Andrew (S4 Cyber) 8129712145"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSdOefkZ3EKoWgKzL_OlP3Edq-wCg7kb3ogHIF2JAp5qb6gydw/viewform?usp=sf_link",
    "prize": ["14,000₹"],
    "desc2(after desc)": "Also join in the Cybersecurity fun by completing Beyond The Surface, an OSINT challenge, which is bound to widen your horizons.",
    "desc": "Capture The Flag (CTF) is a cybersecurity competition that challenges participants to solve a variety of puzzles, tasks, and challenges to obtain \"flags\" hidden within a system. These flags may be in the form of strings, files, or other data, and participants must use their skills in hacking, programming, cryptography, and various other disciplines to uncover and capture them. CTFs are designed to simulate real-world scenarios, allowing participants to develop and showcase their cybersecurity expertise in a controlled environment.",
    "rules": [
      "Rule 1: Participants should bring personal laptops, personal tools are allowed",
      "Rule 2: Teams:2-4 members",
      "Rule 3: Judges' decisions are considered final",
      "Rule 4: Participants must stick to timeframe",
      "Rule 5: Malpractices not tolerated",
      "Rule 6: Non-refundable registration fees, no refunds under any circumstances"
    ]
  },
  {
    "name": "TechnoPark",
    "date": "2 Mar 2024",
    "time": "9:30 AM - 4:30 PM",
    "venue": "Admission Room, M George Block",
    "reg": ["general: free"],
    "cardImg": "https://i.imgur.com/tto58R5.jpeg",
    "cord": [
      "Swathi ( S6 CSE AI DS ) 8714239834",
      "Zanha ( S6 CSE AI DS ) 7907563870"
    ],
    "regLink": "https://forms.gle/Ypqmeae6es7JYJnj9",
    "prize": ["6600₹"],
    "desc": "Get ready for an exhilarating journey into the realms of technology at TECHNOPARK, a groundbreaking event by TinkerHub MITS on March 2nd, 2024. Offering students a hands-on experience with cutting-edge tools provided by Tinkerspace, including a 3D printer, VR goggles, and an intriguing voice-activated Ouija board with an AI model, the event promises to delve into the world of Augmented Reality (AR), Virtual Reality (VR), and innovative technologies. The fusion of AR/VR thrills and 5-6 Arduino/Raspberry Pi projects ensures a day filled with mind-bending experiences and jaw-dropping inventions. Hosted by TinkerHub's tech wizards, TECHNOPARK invites participants to unleash their creativity, discover, and be amazed in a day packed with innovation, laughter, and unadulterated fun. Join us for an epic adventure where imagination meets technology, and boundaries are redefined at TECHNOPARK!",
    "rules": [
      "Rule 1: Participants must handle equipment responsibly;damages incur a fine.",
      "Rule 2:  WebD competitions permit teams of 2; spot registration is available",
      "Rule 3: Laptops are mandatory for 3D printing, Linux Parties, and competitions; participants must bring their own.",
      "Rule 4:  malpractices are strictly prohibited in WebD; decisions of judges will be final.",
      "Rule 5: All events are free of charge."
    ]
  },
  {
    "name": "Brain.io Workshop",
    "date": "2 Mar 2024",
    "time": "9:00 AM - 4:30 PM",
    "venue": "John McCarthy Lab, Ramanujan Block",
    "reg": ["IEEE: 150", "NON-IEEE: 200"],
    "cardImg": "https://i.imgur.com/4uYJID1.jpeg",
    "cord": [
      "Karthik U (S6 ECE) 8281628198",
      "Joanna Merine Noble ( S6 CSE AI ) 8137042277"
    ],
    "regLink": "https://bit.ly/brain_io",
    "prize": ["N/A"],
    "desc": "Impulse, trigger,manifest immerses participants in the cutting-edge field of BCI technology, where the boundaries between mind and machine blur. Through a series of practical exercises and demonstrations, attendees will learn about the principles behind BCI systems, experiment with various neurofeedback techniques, and even build simple brain-controlled applications. This workshop is ideal for anyone curious about the intersection of neuroscience and technology, offering a hands-on experience that will inspire innovation and creativity.",
    "rules": ["N/A"]
  },
  {
    "name": "Gear Up!",
    "date": "2nd March 2024",
    "time": "",
    "venue": "Measurements Lab, (Ramanujan Block)",
    "reg": ["INR 1500/- per team"],
    "cardImg": "https://i.imgur.com/iEpaf1w.png",
    "cord": ["Milan Eldho Babu [9847611144]","Maria Mathew [6235586230]","Winston Antony Robert [8089891361]"],
    "regLink": "https://forms.gle/j9hJYdMQrHxuqwod9",
    "prize": ["The winning team will take home the RC car they built during the workshop!","Plus Activity points, exciting goodies and certificates for all participants!"],
    "desc": "Gear Up: Offroad Odyssey - Build Your Own RC Beast! Join us for an electrifying RC Off-Road Car Workshop at our Techfest event. Unleash your creativity as you build and customize your very own RC beast from scratch. Experience the thrill of testing your creation on rugged terrains and conquer the trails. Each team will be taking home the RC Offroad car they built. Don't miss this chance to learn, race, and win at Shreshta Techfest!",
    "rules": [
    "Rule 1: Everyone would be divided into teams of 5 members each.",
    "Rule 2: Laptops are required for the workshop.",
    "Rule 3: Participants must register on or before 29th February.",
    "Rule 4: There would a testing session at the end.",
    "Rule 5: All the teams would get the RC car they built.",
    "Rule 6: The registration fee is non refundable at any circumstance.",
    "Rule 7: Ethical behaviour is mandatory.",
    "Rule 8: Organizers can disqualify violators.",
    "Rule 9: Respectful conduct toward organizers and participants is mandatory."
    ]
  },
  {
    "name": "Murder Mystery",
    "date": "2nd March 2024",
    "time": "11:00 PM - 2:30 PM",
    "venue": "Room 404 (Ramanujan Block)",
    "reg": ["Free"],
    "cardImg": "https://i.imgur.com/a1YtR1s.jpeg",
    "cord": ["Adish S (S6 CSE) 9645800065"],
    "regLink": "https://forms.gle/2G7QxeV4ZpiKPDst6",
    "prize": ["Certificate","Goodies","Title of Murder Maestro"],
    "desc": "This years murder mystery brings a sophisticated string of mysteries before you to solve. The trail of evidence, statements and suspects have been left to investigate. Teams of 4 are pitted against each other in a race to unravel these knots of mysteries. The clock is ticking, will you be the one to succeed and put an end to this year's murder mystery?.",
    "rules": [
    "Rule 1: Teams must consist of 1 to 4 investigators.",
    "Rule 2: Maximum number of teams permitted for the event is 4.",
    "Rule 3: Cross-college teams are not permitted.",
    "Rule 4: Teams should be always be together during the event and not split up.",
    "Rule 5: Participants must not share deductions and clues.",
    "Rule 6: The decisions of the judges will be final and binding.",
    "Rule 7: Participants must register via the website on or before 27th February. Only one person per team needs to register."
    ]
  },
  {
    "name": "Stargazing",
    "date": "1st March 2024",
    "time": "8:00 PM onwards",
    "venue": "Infront CIDRIE",
    "reg": ["INR 30/-"],
    "cardImg": "https://i.imgur.com/397JDvV.jpeg",
    "cord": ["Afnan - 7025729311","Roshan +91 97780 48743"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSeKdrlKvxFrTG4dkg6g1dzvvAGU2RK6eAY5xEf9RzJt-XLGcg/viewform",
    "prize": ["NIL"],
    "desc": "Immerse yourself in the wonders of the universe with our advanced telescopes🔭, providing an unparalleled sky-watching experience. Witness the cosmos come to life as we explore the mysteries that sparkle above.💫",
    "rules": [
      "Rule 1 : No spot registration available",
      "Rule 2 :  Mandatory for hostellers to request for permission"
    ]
  },
  {
    "name": "Treasure Hunt",
    "date": "1st March 2024",
    "time": "",
    "venue": "College Premises",
    "reg": ["INR 50/-"],
    "cardImg": "https://i.imgur.com/otkN1co.png",
    "cord": ["Reeba Philip 8848912726","Abhinav M P 8086813197"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSf-3LRjegn8T-GBP09M_Fg5W5u7r0lNnOd2ONRz5cvMtLnQDQ/viewform",
    "prize": ["INR 4,000/-"],
    "desc": "Embark on an adventure of a lifetime as you join the Quest for the Lost Treasure! Gather together for a thrilling journey filled with puzzles, clues, and challenges that will test your wit and courage. Follow the  map, solve riddles from deciphering cryptic messages to navigating through hidden passages, every step brings you closer to the ultimate prize. But beware, for the path is fraught with obstacles or must we say imposters who will stop at nothing to claim the treasure for themselves. Only the most cunning and resourceful will emerge victorious. Are you ready to accept the challenge and become a legend? Join us on the Quest for ELDORADO and let the adventure begin!",
    "rules": [
      "Rule 1 : Each team must contain 4 to 6 members.",
      "Rule 2 : Use of mobile phones during the quest is prohibited .",
      "Rule 3 : Teams that collect the given list of items and photographs in the given amount of time that is 30 mins will move on to the final round.",
      "Rule 4 : Hints and trails that will eventually lead you to the treasure will be placed in different parts of the college campus.",
      "Rule 4 : The time allocated for the final round will be 90 mins"
    ]
  },
  {
    "name": "Nexus ex : eFootball",
    "date": "1st March 2024",
    "time": "7:00 PM",
    "venue": "Online",
    "reg": ["INR 50/-"],
    "cardImg": "https://i.imgur.com/C1G0I9H.png",
    "cord": ["Siddarth Anil (S6 CSE b) +91 85939 93860", "Bhavan S (S6 CSE B) +91 9188106460"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLSdjv4oS45UtDJGzpSrW1RLFZKdYPcVU0td9j9ka1VGu0mHigw/viewform",
    "prize": ["First: 1000/- ","Second: 750/- ","Third: 250/-"],
    "desc": "Experience the thrill of virtual football as players compete in our E-Football Tournament. With precise passes, strategic plays, and heart-pounding moments, this event will showcase the skills of the best virtual footballers on campus.",
    "rules": [
      "Rule 1 : No Emulators are allowed.",
      "Rule 2 : Cheating is prohibited",
      "Rule 3 : Any substitutions should be notified before-hand.",
      "Rule 4 : Network and power will not be provided unless necessary."
    ]
  },
  {
    "name": "Nexus ex : BGMI",
    "date": "1st March 2024",
    "time": "7:00 PM",
    "venue": "Online",
    "reg": ["INR 50/-"],
    "cardImg": "https://i.imgur.com/5pR9Vfl.png",
    "cord": ["Siddarth Anil (S6 CSE b) +91 85939 93860", "Bhavan S (S6 CSE B) +91 9188106460"],
    "regLink": "https://docs.google.com/forms/d/e/1FAIpQLScPBuDZ_d25OYu4tiheh7lc31lkOKGama3B9aqeZ1PZNQjCig/viewform",
    "prize": ["First: 1000/- ","Second: 750/- ","Third: 250/-"],
    "desc": "Gear up for intense battles and fierce competition in our BGMI Championship. Teams will fight for survival, strategizing their moves and outwitting opponents in the ultimate test of skill and strategy.",
    "rules": [
      "Rule 1 : No Emulators are allowed.",
      "Rule 2 : Cheating is prohibited",
      "Rule 3 : Any substitutions should be notified before-hand.",
      "Rule 4 : Network and power will not be provided unless necessary.",
      "Rule 5 : 2-4 members are allowed."
    ]
  }
]
